[
  {
    "seasonNum": 1,
    "episodeNum": 1,
    "episodeTitle": "Winter Is Coming",
    "episodeLink": "/title/tt1480055/",
    "episodeAirDate": "2011-04-17",
    "episodeDescription": "Jon Arryn, the Hand of the King, is dead. King Robert Baratheon plans to ask his oldest friend, Eddard Stark, to take Jon's place. Across the sea, Viserys Targaryen plans to wed his sister to a nomadic warlord in exchange for an army."
  },
  {
    "seasonNum": 1,
    "episodeNum": 2,
    "episodeTitle": "The Kingsroad",
    "episodeLink": "/title/tt1668746/",
    "episodeAirDate": "2011-04-24",
    "episodeDescription": "While Bran recovers from his fall, Ned takes only his daughters to King's Landing. Jon Snow goes with his uncle Benjen to The Wall. Tyrion joins them."
  },
  {
    "seasonNum": 1,
    "episodeNum": 3,
    "episodeTitle": "Lord Snow",
    "episodeLink": "/title/tt1829962/",
    "episodeAirDate": "2011-05-01",
    "episodeDescription": "Lord Stark and his daughters arrive at King's Landing to discover the intrigues of the king's realm."
  },
  {
    "seasonNum": 1,
    "episodeNum": 4,
    "episodeTitle": "Cripples, Bastards, and Broken Things",
    "episodeLink": "/title/tt1829963/",
    "episodeAirDate": "2011-05-08",
    "episodeDescription": "Eddard investigates Jon Arryn's murder. Jon befriends Samwell Tarly, a coward who has come to join the Night's Watch."
  },
  {
    "seasonNum": 1,
    "episodeNum": 5,
    "episodeTitle": "The Wolf and the Lion",
    "episodeLink": "/title/tt1829964/",
    "episodeAirDate": "2011-05-15",
    "episodeDescription": "Catelyn has captured Tyrion and plans to bring him to her sister, Lysa Arryn, at The Vale, to be tried for his, supposed, crimes against Bran. Robert plans to have Daenerys killed, but Eddard refuses to be a part of it and quits."
  },
  {
    "seasonNum": 1,
    "episodeNum": 6,
    "episodeTitle": "A Golden Crown",
    "episodeLink": "/title/tt1837862/",
    "episodeAirDate": "2011-05-22",
    "episodeDescription": "While recovering from his battle with Jaime, Eddard is forced to run the kingdom while Robert goes hunting. Tyrion demands a trial by combat for his freedom. Viserys is losing his patience with Drogo."
  },
  {
    "seasonNum": 1,
    "episodeNum": 7,
    "episodeTitle": "You Win or You Die",
    "episodeLink": "/title/tt1837863/",
    "episodeAirDate": "2011-05-29",
    "episodeDescription": "Robert has been injured while hunting and is dying. Jon and the others finally take their vows to the Night's Watch. A man, sent by Robert, is captured for trying to poison Daenerys. Furious, Drogo vows to attack the Seven Kingdoms."
  },
  {
    "seasonNum": 1,
    "episodeNum": 8,
    "episodeTitle": "The Pointy End",
    "episodeLink": "/title/tt1837864/",
    "episodeAirDate": "2011-06-05",
    "episodeDescription": "Eddard and his men are betrayed and captured by the Lannisters. When word reaches Robb, he plans to go to war to rescue them. The White Walkers attack The Wall. Tyrion returns to his father with some new friends."
  },
  {
    "seasonNum": 1,
    "episodeNum": 9,
    "episodeTitle": "Baelor",
    "episodeLink": "/title/tt1851398/",
    "episodeAirDate": "2011-06-12",
    "episodeDescription": "Robb goes to war against the Lannisters. Jon finds himself struggling on deciding if his place is with Robb or the Night's Watch. Drogo has fallen ill from a fresh battle wound. Daenerys is desperate to save him."
  },
  {
    "seasonNum": 1,
    "episodeNum": 10,
    "episodeTitle": "Fire and Blood",
    "episodeLink": "/title/tt1851397/",
    "episodeAirDate": "2011-06-19",
    "episodeDescription": "With Ned dead, Robb vows to get revenge on the Lannisters. Jon must officially decide if his place is with Robb or the Night's Watch. Daenerys says her final goodbye to Drogo."
  },
  {
    "seasonNum": 2,
    "episodeNum": 1,
    "episodeTitle": "The North Remembers",
    "episodeLink": "/title/tt1971833/",
    "episodeAirDate": "2012-04-01",
    "episodeDescription": "Tyrion arrives at King's Landing to take his father's place as Hand of the King. Stannis Baratheon plans to take the Iron Throne for his own. Robb tries to decide his next move in the war. The Night's Watch arrive at the house of Craster."
  },
  {
    "seasonNum": 2,
    "episodeNum": 2,
    "episodeTitle": "The Night Lands",
    "episodeLink": "/title/tt2069318/",
    "episodeAirDate": "2012-04-08",
    "episodeDescription": "Arya makes friends with Gendry. Tyrion tries to take control of the small council. Theon arrives at his home, Pyke, in order to persuade his father into helping Robb with the war. Jon tries to investigate Craster's secret."
  },
  {
    "seasonNum": 2,
    "episodeNum": 3,
    "episodeTitle": "What Is Dead May Never Die",
    "episodeLink": "/title/tt2070135/",
    "episodeAirDate": "2012-04-15",
    "episodeDescription": "Tyrion tries to see who he can trust in the small council. Catelyn visits Renly to try and persuade him to join Robb in the war. Theon must decide if his loyalties lie with his own family or with Robb."
  },
  {
    "seasonNum": 2,
    "episodeNum": 4,
    "episodeTitle": "Garden of Bones",
    "episodeLink": "/title/tt2069319/",
    "episodeAirDate": "2012-04-22",
    "episodeDescription": "Lord Baelish arrives at Renly's camp just before he faces off against Stannis. Daenerys and her company are welcomed into the city of Qarth. Arya, Gendry, and Hot Pie find themselves imprisoned at Harrenhal."
  },
  {
    "seasonNum": 2,
    "episodeNum": 5,
    "episodeTitle": "The Ghost of Harrenhal",
    "episodeLink": "/title/tt2074658/",
    "episodeAirDate": "2012-04-29",
    "episodeDescription": "Tyrion investigates a secret weapon that King Joffrey plans to use against Stannis. Meanwhile, as a token for saving his life, Jaqen H'ghar offers to kill three people that Arya chooses."
  },
  {
    "seasonNum": 2,
    "episodeNum": 6,
    "episodeTitle": "The Old Gods and the New",
    "episodeLink": "/title/tt2085238/",
    "episodeAirDate": "2012-05-06",
    "episodeDescription": "Theon seizes control of Winterfell. Jon captures a wildling, named Ygritte. The people of King's Landing begin to turn against King Joffrey. Daenerys looks to buy ships to sail for the Seven Kingdoms."
  },
  {
    "seasonNum": 2,
    "episodeNum": 7,
    "episodeTitle": "A Man Without Honor",
    "episodeLink": "/title/tt2085239/",
    "episodeAirDate": "2012-05-13",
    "episodeDescription": "Bran and Rickon have escaped Winterfell. Theon tries to hunt them down. Daenerys' dragons have been stolen. Jon travels through the wilderness with Ygritte as his prisoner. Sansa has bled and is now ready to have Joffrey's children."
  },
  {
    "seasonNum": 2,
    "episodeNum": 8,
    "episodeTitle": "The Prince of Winterfell",
    "episodeLink": "/title/tt2085240/",
    "episodeAirDate": "2012-05-20",
    "episodeDescription": "Stannis is just days from King's Landing. Tyrion prepares for his arrival. Jon and Qhorin are taken prisoner by the wildlings. Catelyn is arrested for releasing Jaime. Arya, Gendry, and Hot Pie plan to escape from Harrenhal."
  },
  {
    "seasonNum": 2,
    "episodeNum": 9,
    "episodeTitle": "Blackwater",
    "episodeLink": "/title/tt2084342/",
    "episodeAirDate": "2012-05-27",
    "episodeDescription": "Stannis Baratheon's fleet and army arrive at King's Landing and the battle for the city begins. Cersei plans for her and her children's future."
  },
  {
    "seasonNum": 2,
    "episodeNum": 10,
    "episodeTitle": "Valar Morghulis",
    "episodeLink": "/title/tt2112510/",
    "episodeAirDate": "2012-06-03",
    "episodeDescription": "Joffrey puts Sansa aside for Margaery Tyrell. Robb marries Talisa Maegyr. Jon prepares to meet Mance Rayder. Arya says farewell to Jaqen H'ghar. Daenerys tries to rescue her dragons."
  },
  {
    "seasonNum": 3,
    "episodeNum": 1,
    "episodeTitle": "Valar Dohaeris",
    "episodeLink": "/title/tt2178782/",
    "episodeAirDate": "2013-03-31",
    "episodeDescription": "Jon is brought before Mance Rayder, the King Beyond the Wall, while the Night's Watch survivors retreat south. In King's Landing, Tyrion asks for his reward. Littlefinger offers Sansa a way out."
  },
  {
    "seasonNum": 3,
    "episodeNum": 2,
    "episodeTitle": "Dark Wings, Dark Words",
    "episodeLink": "/title/tt2178772/",
    "episodeAirDate": "2013-04-07",
    "episodeDescription": "Bran and company meet Jojen and Meera Reed. Arya, Gendry, and Hot Pie meet the Brotherhood. Jaime travels through the wilderness with Brienne. Sansa confesses her true feelings about Joffrey to Margaery."
  },
  {
    "seasonNum": 3,
    "episodeNum": 3,
    "episodeTitle": "Walk of Punishment",
    "episodeLink": "/title/tt2178802/",
    "episodeAirDate": "2013-04-14",
    "episodeDescription": "Robb and Catelyn arrive at Riverrun for Lord Hoster Tully's funeral. Tywin names Tyrion the new Master of Coin. Arya says goodbye to Hot Pie. The Night's Watch returns to Craster's. Brienne and Jaime are taken prisoner."
  },
  {
    "seasonNum": 3,
    "episodeNum": 4,
    "episodeTitle": "And Now His Watch Is Ended",
    "episodeLink": "/title/tt2178798/",
    "episodeAirDate": "2013-04-21",
    "episodeDescription": "Jaime mopes over his lost hand. Cersei is growing uncomfortable with the Tyrells. The Night's Watch is growing impatient with Craster. Daenerys buys the Unsullied."
  },
  {
    "seasonNum": 3,
    "episodeNum": 5,
    "episodeTitle": "Kissed by Fire",
    "episodeLink": "/title/tt2178788/",
    "episodeAirDate": "2013-04-28",
    "episodeDescription": "Robb's army is falling apart. Jaime reveals a story, to Brienne, that he has never told anyone. Jon breaks his vows. The Hound is granted his freedom. The Lannisters hatch a new plan."
  },
  {
    "seasonNum": 3,
    "episodeNum": 6,
    "episodeTitle": "The Climb",
    "episodeLink": "/title/tt2178812/",
    "episodeAirDate": "2013-05-05",
    "episodeDescription": "Jon and the wildlings scale The Wall. The Brotherhood sells Gendry to Melisandre. Robb does what he can to win back the Freys. Tyrion tells Sansa about their engagement."
  },
  {
    "seasonNum": 3,
    "episodeNum": 7,
    "episodeTitle": "The Bear and the Maiden Fair",
    "episodeLink": "/title/tt2178814/",
    "episodeAirDate": "2013-05-12",
    "episodeDescription": "Jon and the wildlings travel south of The Wall. Talisa tells Robb that she's pregnant. Arya runs away from the Brotherhood. Daenerys arrives at Yunkai. Jaime leaves Brienne behind at Harrenhal."
  },
  {
    "seasonNum": 3,
    "episodeNum": 8,
    "episodeTitle": "Second Sons",
    "episodeLink": "/title/tt2178806/",
    "episodeAirDate": "2013-05-19",
    "episodeDescription": "Daenerys tries to persuade the Second Sons to join her against Yunkai. Stannis releases Davos from the dungeons. Sam and Gilly are attacked by a White Walker. Sansa and Tyrion wed."
  },
  {
    "seasonNum": 3,
    "episodeNum": 9,
    "episodeTitle": "The Rains of Castamere",
    "episodeLink": "/title/tt2178784/",
    "episodeAirDate": "2013-06-02",
    "episodeDescription": "Robb and Catelyn arrive at the Twins for the wedding. Jon is put to the test to see where his loyalties truly lie. Bran's group decides to split up. Daenerys plans an invasion of Yunkai."
  },
  {
    "seasonNum": 3,
    "episodeNum": 10,
    "episodeTitle": "Mhysa",
    "episodeLink": "/title/tt2178796/",
    "episodeAirDate": "2013-06-09",
    "episodeDescription": "Bran and company travel beyond The Wall. Sam returns to Castle Black. Jon says good bye to Ygritte. Jaime returns to King's Landing. The Night's Watch asks for help from Stannis."
  },
  {
    "seasonNum": 4,
    "episodeNum": 1,
    "episodeTitle": "Two Swords",
    "episodeLink": "/title/tt2816136/",
    "episodeAirDate": "2014-04-06",
    "episodeDescription": "Tyrion welcomes a guest to King's Landing. At Castle Black, Jon stands trial. Daenerys is pointed to Meereen, the mother of all slave cities. Arya runs into an old enemy."
  },
  {
    "seasonNum": 4,
    "episodeNum": 2,
    "episodeTitle": "The Lion and the Rose",
    "episodeLink": "/title/tt2832378/",
    "episodeAirDate": "2014-04-13",
    "episodeDescription": "Joffrey and Margaery's wedding has come. Tyrion breaks up with Shae. Ramsay tries to prove his worth to his father. Bran and company find a Weirwood tree."
  },
  {
    "seasonNum": 4,
    "episodeNum": 3,
    "episodeTitle": "Breaker of Chains",
    "episodeLink": "/title/tt2972426/",
    "episodeAirDate": "2014-04-20",
    "episodeDescription": "Tyrion is arrested for the murder of Joffrey and awaits trial. Sansa escapes King's Landing. Sam sends Gilly to Mole's Town as the Night's Watch finds itself in a tight spot. Meereen challenges Daenerys."
  },
  {
    "seasonNum": 4,
    "episodeNum": 4,
    "episodeTitle": "Oathkeeper",
    "episodeLink": "/title/tt2972428/",
    "episodeAirDate": "2014-04-27",
    "episodeDescription": "Jaime entrusts a task to Brienne. Daenerys frees Meereen. Jon is given permission to lead a group of Night's Watchmen to Craster's Keep. Bran and company are taken hostage."
  },
  {
    "seasonNum": 4,
    "episodeNum": 5,
    "episodeTitle": "First of His Name",
    "episodeLink": "/title/tt3060856/",
    "episodeAirDate": "2014-05-04",
    "episodeDescription": "Tommen is crowned King of the Seven Kingdoms. Cersei builds her case against Tyrion. Sansa and Lord Baelish arrive at the Eyrie. The Night's Watch attacks Craster's Keep."
  },
  {
    "seasonNum": 4,
    "episodeNum": 6,
    "episodeTitle": "The Laws of Gods and Men",
    "episodeLink": "/title/tt3060910/",
    "episodeAirDate": "2014-05-11",
    "episodeDescription": "Tyrion's trial has come. Yara and her troops storm the Dreadfort to free Theon. Daenerys meets Hizdar zo Loraq. Stannis makes a deal with the Iron Bank of Braavos."
  },
  {
    "seasonNum": 4,
    "episodeNum": 7,
    "episodeTitle": "Mockingbird",
    "episodeLink": "/title/tt3060876/",
    "episodeAirDate": "2014-05-18",
    "episodeDescription": "Tyrion tries to find a champion. Daenerys sleeps with Daario. The Hound becomes wounded. Jon's advice is ignored at Castle Black. Brienne and Podrick receive a tip on Arya's whereabouts."
  },
  {
    "seasonNum": 4,
    "episodeNum": 8,
    "episodeTitle": "The Mountain and the Viper",
    "episodeLink": "/title/tt3060782/",
    "episodeAirDate": "2014-06-01",
    "episodeDescription": "Theon helps Ramsay seize Moat Cailin. The wildlings attack Mole's Town. Sansa comes up with a story to protect Lord Baelish. Daenerys finds out a secret about Ser Jorah. Oberyn Martell faces Ser Gregor Clegane."
  },
  {
    "seasonNum": 4,
    "episodeNum": 9,
    "episodeTitle": "The Watchers on the Wall",
    "episodeLink": "/title/tt3060858/",
    "episodeAirDate": "2014-06-08",
    "episodeDescription": "The battle between the Night's Watch and the Wildlings has come."
  },
  {
    "seasonNum": 4,
    "episodeNum": 10,
    "episodeTitle": "The Children",
    "episodeLink": "/title/tt3060860/",
    "episodeAirDate": "2014-06-15",
    "episodeDescription": "The Night's Watch story continues, with surprising developments. Daenerys experiences new consequences. Brienne and Podrick have an unexpected encounter. Bran achieves a goal, while Tyrion makes an important discovery."
  },
  {
    "seasonNum": 5,
    "episodeNum": 1,
    "episodeTitle": "The Wars to Come",
    "episodeLink": "/title/tt3658012/",
    "episodeAirDate": "2015-03-29",
    "episodeDescription": "Cersei and Jaime adjust to a world without Tywin. Tyrion and Varys arrive at Pentos. In Meereen, a new enemy emerges. Jon is caught between two kings."
  },
  {
    "seasonNum": 5,
    "episodeNum": 2,
    "episodeTitle": "The House of Black and White",
    "episodeLink": "/title/tt3846626/",
    "episodeAirDate": "2015-04-19",
    "episodeDescription": "Arya arrives in Braavos. Jaime takes on a secret mission. Ellaria Sand seeks revenge for Oberyn's death. Stannis makes Jon a generous offer as the Night's Watch elects a new Lord Commander. Daenerys is faced with a difficult decision."
  },
  {
    "seasonNum": 5,
    "episodeNum": 3,
    "episodeTitle": "High Sparrow",
    "episodeLink": "/title/tt3866836/",
    "episodeAirDate": "2015-04-26",
    "episodeDescription": "Tommen and Margaery wed. Arya has trouble adapting to her new life. Littlefinger reveals his plans to Sansa. Jon gives his first orders as Lord Commander. Tyrion and Varys arrive in Volantis."
  },
  {
    "seasonNum": 5,
    "episodeNum": 4,
    "episodeTitle": "Sons of the Harpy",
    "episodeLink": "/title/tt3866838/",
    "episodeAirDate": "2015-05-03",
    "episodeDescription": "Jorah Mormont sets sail alongside his prisoner, Tyrion. Cersei makes a move against the Tyrells. Jaime and Bronn sneak into Dorne. Ellaria and the Sand Snakes make their plans. Melisandre tempts Jon. The Harpies attack."
  },
  {
    "seasonNum": 5,
    "episodeNum": 5,
    "episodeTitle": "Kill the Boy",
    "episodeLink": "/title/tt3866840/",
    "episodeAirDate": "2015-05-10",
    "episodeDescription": "Daenerys arrests the heads of Meereen's great families. Jon makes a difficult decision. Theon is forced to face Sansa. Stannis rides south. Tyrion and Jorah enter the ruins of Old Valyria."
  },
  {
    "seasonNum": 5,
    "episodeNum": 6,
    "episodeTitle": "Unbowed, Unbent, Unbroken",
    "episodeLink": "/title/tt3866842/",
    "episodeAirDate": "2015-05-17",
    "episodeDescription": "Arya is put to the test. Tyrion and Jorah are captured by slavers. Loras Tyrell is judged by the Sparrows. Jaime and Bronn face the Sand Snakes. Sansa marries Ramsay Bolton."
  },
  {
    "seasonNum": 5,
    "episodeNum": 7,
    "episodeTitle": "The Gift",
    "episodeLink": "/title/tt3866846/",
    "episodeAirDate": "2015-05-24",
    "episodeDescription": "Jon heads east as trouble begins to stir for Sam and Gilly at Castle Black. Sansa asks Theon for help. Tyrion and Jorah are sold as slaves. Cersei savors her triumph over the Tyrells as new plots are developed in the shadows."
  },
  {
    "seasonNum": 5,
    "episodeNum": 8,
    "episodeTitle": "Hardhome",
    "episodeLink": "/title/tt3866850/",
    "episodeAirDate": "2015-05-31",
    "episodeDescription": "Tyrion advises Daenerys. Sansa forces Theon to tell her a secret. Cersei remains stubborn. Arya meets her first target. Jon and Tormund meet with the Wildling Elders."
  },
  {
    "seasonNum": 5,
    "episodeNum": 9,
    "episodeTitle": "The Dance of Dragons",
    "episodeLink": "/title/tt3866826/",
    "episodeAirDate": "2015-06-07",
    "episodeDescription": "Jon and the Wildlings return to Castle Black. Jaime meets with Doran Martell. Stannis makes a hard choice. Arya runs into Ser Meryn Trant. Daenerys attends the grand reopening of the fighting pits."
  },
  {
    "seasonNum": 5,
    "episodeNum": 10,
    "episodeTitle": "Mother's Mercy",
    "episodeLink": "/title/tt3866862/",
    "episodeAirDate": "2015-06-14",
    "episodeDescription": "Stannis arrives at Winterfell. Tyrion runs Meereen as Daario and Jorah go after Daenerys. Jaime and Myrcella leave Dorne. Jon sends Sam and Gilly to Oldtown. Arya challenges the Many-Faced God. Cersei confesses her sins."
  },
  {
    "seasonNum": 6,
    "episodeNum": 1,
    "episodeTitle": "The Red Woman",
    "episodeLink": "/title/tt3658014/",
    "episodeAirDate": "2016-04-24",
    "episodeDescription": "The fate of Jon Snow is revealed. Daenerys is brought before Khal Moro. Tyrion gets used to living in Meereen. Ramsay sends his dogs after Theon and Sansa. Ellaria and the Sand Snakes make their move. Cersei mourns for Myrcella."
  },
  {
    "seasonNum": 6,
    "episodeNum": 2,
    "episodeTitle": "Home",
    "episodeLink": "/title/tt4077554/",
    "episodeAirDate": "2016-05-01",
    "episodeDescription": "Bran trains with the Three-Eyed Raven. Tommen meets with Cersei. Tyrion makes a bold move. Theon leaves while at Pyke new issues arise. Ramsay's brother is born. Davos asks Melisandre for a miracle."
  },
  {
    "seasonNum": 6,
    "episodeNum": 3,
    "episodeTitle": "Oathbreaker",
    "episodeLink": "/title/tt4131606/",
    "episodeAirDate": "2016-05-08",
    "episodeDescription": "Daenerys arrives at Vaes Dothrak. Sam and Gilly sail for Horn Hill. Arya trains as No One. Varys finds information on the Sons of the Harpy. Ramsay receives a gift. Tommen meets with the High Sparrow. At Castle Black, a miracle occurs."
  },
  {
    "seasonNum": 6,
    "episodeNum": 4,
    "episodeTitle": "Book of the Stranger",
    "episodeLink": "/title/tt4283016/",
    "episodeAirDate": "2016-05-15",
    "episodeDescription": "Sansa arrives at Castle Black. Tyrion makes a deal with the Slave Masters. Jorah and Daario sneak into Vaes Dothrak. Ramsay sends a letter to Jon. Theon arrives at Pyke. Cersei and Olenna Tyrell plot against the High Sparrow."
  },
  {
    "seasonNum": 6,
    "episodeNum": 5,
    "episodeTitle": "The Door",
    "episodeLink": "/title/tt4283028/",
    "episodeAirDate": "2016-05-22",
    "episodeDescription": "Sansa and Jon make plans. Arya is given another chance to prove herself. Jorah confesses a secret to Daenerys. Tyrion meets with a Red Priestess. Yara finds her rule tested. Bran discovers the origin of the White Walkers."
  },
  {
    "seasonNum": 6,
    "episodeNum": 6,
    "episodeTitle": "Blood of My Blood",
    "episodeLink": "/title/tt4283054/",
    "episodeAirDate": "2016-05-29",
    "episodeDescription": "Bran and Meera find a new ally. Gilly meets Sam's family. Arya makes a difficult choice. The Lannisters and Tyrells march against the High Sparrow."
  },
  {
    "seasonNum": 6,
    "episodeNum": 7,
    "episodeTitle": "The Broken Man",
    "episodeLink": "/title/tt4283060/",
    "episodeAirDate": "2016-06-05",
    "episodeDescription": "Jon and Sansa gather troops. Jaime arrives at Riverrun. Olenna Tyrell plans to leave King's Landing. Theon and Yara plan a destination. Arya makes plans to leave."
  },
  {
    "seasonNum": 6,
    "episodeNum": 8,
    "episodeTitle": "No One",
    "episodeLink": "/title/tt4283074/",
    "episodeAirDate": "2016-06-12",
    "episodeDescription": "Brienne arrives at Riverrun. Arya seeks shelter. Jaime meets with Edmure Tully. Cersei challenges the Faith. Sandor Clegane hunts for revenge. Tyrion faces the consequences of earlier decisions."
  },
  {
    "seasonNum": 6,
    "episodeNum": 9,
    "episodeTitle": "Battle of the Bastards",
    "episodeLink": "/title/tt4283088/",
    "episodeAirDate": "2016-06-19",
    "episodeDescription": "Jon and Sansa face Ramsay Bolton on the fields of Winterfell. Daenerys strikes back at her enemies. Theon and Yara arrive in Meereen."
  },
  {
    "seasonNum": 6,
    "episodeNum": 10,
    "episodeTitle": "The Winds of Winter",
    "episodeLink": "/title/tt4283094/",
    "episodeAirDate": "2016-06-26",
    "episodeDescription": "Cersei and Loras Tyrell stand trial by the gods. Daenerys prepares to set sail for Westeros. Davos confronts Melisandre. Sam and Gilly arrive in Oldtown. Bran discovers a long kept secret. Lord Frey has an uninvited guest."
  },
  {
    "seasonNum": 7,
    "episodeNum": 1,
    "episodeTitle": "Dragonstone",
    "episodeLink": "/title/tt5654088/",
    "episodeAirDate": "2017-07-16",
    "episodeDescription": "Jon organizes the North's defenses. Cersei tries to even the odds. Daenerys comes home. Arya reminds the Freys \"The North remembers\". Sam adapts to life in Oldtown. Night King makes his way south."
  },
  {
    "seasonNum": 7,
    "episodeNum": 2,
    "episodeTitle": "Stormborn",
    "episodeLink": "/title/tt5655178/",
    "episodeAirDate": "2017-07-23",
    "episodeDescription": "Daenerys receives an unexpected visitor. Jon faces resistance. Tyrion plans the conquest of Westeros. Cersei gathers her allies. Arya has a reunion with old friends. Sam risks his career and life."
  },
  {
    "seasonNum": 7,
    "episodeNum": 3,
    "episodeTitle": "The Queen's Justice",
    "episodeLink": "/title/tt5775840/",
    "episodeAirDate": "2017-07-30",
    "episodeDescription": "Daenerys and Jon meet. Cersei gains a new ally. Sansa receives an unexpected visitor. Sam is confronted for his actions."
  },
  {
    "seasonNum": 7,
    "episodeNum": 4,
    "episodeTitle": "The Spoils of War",
    "episodeLink": "/title/tt5775846/",
    "episodeAirDate": "2017-08-06",
    "episodeDescription": "Daenerys takes matters into her own hands. Arya reaches her destination. Jaime and Bronn collect the spoils from the war with the Tyrells."
  },
  {
    "seasonNum": 7,
    "episodeNum": 5,
    "episodeTitle": "Eastwatch",
    "episodeLink": "/title/tt5775854/",
    "episodeAirDate": "2017-08-13",
    "episodeDescription": "Daenerys demands loyalty from the surviving Lannister soldiers; Jon heeds Bran's warning about White Walkers on the move; Cersei vows to vanquish anyone or anything that stands in her way."
  },
  {
    "seasonNum": 7,
    "episodeNum": 6,
    "episodeTitle": "Beyond the Wall",
    "episodeLink": "/title/tt5775864/",
    "episodeAirDate": "2017-08-20",
    "episodeDescription": "Jon and his team go beyond the wall to capture a wight. Daenerys has to make a tough decision."
  },
  {
    "seasonNum": 7,
    "episodeNum": 7,
    "episodeTitle": "The Dragon and the Wolf",
    "episodeLink": "/title/tt5775874/",
    "episodeAirDate": "2017-08-27",
    "episodeDescription": "Season finale of the epic series."
  },
  {
    "seasonNum": 8,
    "episodeNum": 1,
    "episodeTitle": "Winterfell",
    "episodeLink": "/title/tt5924366/",
    "episodeAirDate": "2019-04-14",
    "episodeDescription": "Jon and Daenerys arrive in Winterfell and are met with skepticism. Sam learns about the fate of his family. Cersei gives Euron the reward he aims for. Theon follows his heart."
  },
  {
    "seasonNum": 8,
    "episodeNum": 2,
    "episodeTitle": "A Knight of the Seven Kingdoms",
    "episodeLink": "/title/tt6027908/",
    "episodeAirDate": "2019-04-21",
    "episodeDescription": "The battle at Winterfell is approaching. Jaime is confronted with the consequences of the past. A tense interaction between Sansa and Daenerys follows."
  },
  {
    "seasonNum": 8,
    "episodeNum": 3,
    "episodeTitle": "The Long Night",
    "episodeLink": "/title/tt6027912/",
    "episodeAirDate": "2019-04-28",
    "episodeDescription": "The Night King and his army have arrived at Winterfell and the great battle begins."
  },
  {
    "seasonNum": 8,
    "episodeNum": 4,
    "episodeTitle": "The Last of the Starks",
    "episodeLink": "/title/tt6027914/",
    "episodeAirDate": "2019-05-05",
    "episodeDescription": "In the wake of a costly victory, Jon and Daenerys look to the south as Tyrion eyes a compromise that could save countless lives."
  },
  {
    "seasonNum": 8,
    "episodeNum": 5,
    "episodeTitle": "The Bells",
    "episodeLink": "/title/tt6027916/",
    "episodeAirDate": "2019-05-12",
    "episodeDescription": "Daenerys and Cersei weigh their options as an epic conflict looms at King's Landing."
  },
  {
    "seasonNum": 8,
    "episodeNum": 6,
    "episodeTitle": "The Iron Throne",
    "episodeLink": "/title/tt6027920/",
    "episodeAirDate": "2019-05-19",
    "episodeDescription": "In the aftermath of the devastating attack on King's Landing, Daenerys must face the survivors."
  }
]